In [2]:
import pandas as pd
import numpy as np

In [9]:
df = pd.DataFrame([])
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                                "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                                "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                                 pd.NaT]})
df

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [10]:
df.dropna()

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [13]:
df.fillna(0)

       name        toy                 born
0    Alfred          0                    0
1    Batman  Batmobile  1940-04-25 00:00:00
2  Catwoman   Bullwhip                    0

In [15]:
df = pd.DataFrame([[np.nan, 2, np.nan, 0],
                    [3, 4, np.nan, 1],
                    [np.nan, np.nan, np.nan, 5],
                    [np.nan, 3, np.nan, 4]],
                    columns=list('ABCD'))
df

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5
3  NaN  3.0 NaN  4

In [19]:
fill_na_value = df['D'].mean()

In [20]:
df.fillna(fill_na_value)

     A    B    C  D
0  2.5  2.0  2.5  0
1  3.0  4.0  2.5  1
2  2.5  2.5  2.5  5
3  2.5  3.0  2.5  4

In [23]:
df.isnull()

       A      B     C      D
0   True  False  True  False
1  False  False  True  False
2   True   True  True  False
3   True  False  True  False

In [24]:
df.isnull().sum()

A    3
B    1
C    4
D    0
dtype: int64